import React from "react";
import featureOrganic from "../../feature-organic.jpg"; // Updated import path
import image1 from "./1.png"; // Adjust path as necessary

const Theory26: React.FC = () => {
  return (
    <div
      style={{
        padding: "20px",
        margin: "20px",
        backgroundColor: "white",
        fontFamily: "Arial, sans-serif",
        lineHeight: 1.6,
        color: "black",
      }}
    >
      <h1
        style={{
          color: "#333",
          textAlign: "center",
          fontSize: "40px",
          fontWeight: "bolder",
        }}
      >
        <b>26. බය නැති කරගමු!</b>
      </h1>
      <p>
        <br />
      </p>
      <p className="blue">
        කාබනික රසායනය theory කොටසෙහි අවසාන ලිපිය මෙය වන අතර කොටස් අංක 22 සිට
        කාබනික රසායනය අනෙක් තියරි ORGANIC CHEMISTRY PRO කොටසෙහි ඇතුලත් කරනු
        ලැබෙයි..
      </p>
      <p>
        <b>ඔර්ගනික් වලින් භාගයකට වඩා අපී ඉවරයි ..!!!</b>
      </p>
      <br />
      <img
        src={image1}
        alt=""
        style={{ display: "block", margin: "20px auto", maxWidth: "100%" }}
      />
      <br />
      <p>
        විශ්වාස කරන්න බෑ වගේද?..
        <b>
          නැ මචන් අපි ඔර්ගනික් වල අමාරු හරිය ගොඩදාගෙන ඉවරයි..ඉස්සරහට තීන්නෙ
          බෙන්සීන් පරිවර්තන..
        </b>
        නම අමුතුයි වගේ නිසා මොන මගුල් තීද දන්නැ කියලා හිතෙන එක සධාරනයි ....ඒත්
        බෙන්සීන් සමග තීන පරිවර්තන අපි කරපු තරම් අමාරූ නැ...බෙන්සීන් කියන්නෙ
        කාබන් හයක්..බයවෙන්න තරම් දේවල් බෙන්සීන් එකේ නැ.!
      </p>
      <p className="specialPoints">ඇයි මන් මෙච්චර මේක ලේසියි කියන්නෙ?</p>
      <p>
        <b>
          මතක තියාගන්න ලේසියි.! ඒ වගේම පාස්ට් පේපර්ස් වලත් නිතරම ප්‍රශ්නයක්
          අඩංගු වෙනවා බෙන්සීන් සම්බන්ධව... ඇයි මේ කට්ටිය අමාරු කියන්නෙ? මට
          හිතෙන්නෙ අර රූපෙට වෙන්න ඕන..ගොඩක් උන් බෙන්සීන් අඩංගු පරිවර්තනයක්
          දැක්කාම බයයි..උන් හිතන්නෙ බෙන්සීන් කියන්නෙ නිධානයක් කියලා..නිධාන ගන්න
          කට්ට්ටිය බයයිනෙ..භූතයො යක්කු බැදලා ආරක්ශා කරන දෙයක්ලු නේ! ඉතින්
          බෙන්සීන් පරිවර්තනයක් කරන එක නිධන් හාරනෝ වගේ වැඩක්ලු,පුරාවිද්‍යා
          දෙපාර්තුමේන්තුවෙන් උස්සන් යයි කියලා බය වෙනවා!!
        </b>
      </p>
      <p className="specialPoints">පන්ඩිත වැඩි උනාමත් කොරන්න බෑලු</p>
      <p>
        සමහරුන්ට බෙන්සීන් ගැන ගැඹුරින් අධ්‍යනය කරන්න ඕනෙලු ! ඒලෙවල් පේපරේ උබලා
        ඔය ගැඹුරින් කියල කරන අද්‍යනයන් ගැන ප්‍රශ්න අහන්නෙ නැ.. තව සමහරුන්ට
        බෙන්සීන් වල ඉතිහාසය, කොහොමද හොයාගත්තෙ වගේ ඕනෙලූ! ඒලෙවල් පේපරේ කවදාවත්
        බෙන්සීන් ගැන රචනාවක් ලියන්න අහන්නෙ නෑ..
      </p>

      <p>
        මන් මේ තියරි එක හැදුවෙත් ඕර්ගනික් තනියම මේක බලලා ඉගෙනගන්න පුලුවන්
        වෙන්න...ඉතින් අනව්ශය වැල් වටාරම් බයිලා ඔක්කොම අයින් කරලා තමා මන් ලිපි
        ලිව්වෙ....මන් මේකෙ ලියලා තීන අකුරක් ගානෙ උබලට ගොඩක් වැදගත්..ක්ලාස් වල මේ
        විදියේ නෝට් නැනෙ..මොකද ටියුශන් කාරයටත් ඕන පොත පුරවන්න..එතකොටලු ලමයට
        දැනෙන්නෙ මේ සර් ගොඩක් උගන්වනවා කියලා.... ඉතින් එහෙම කියලා උබලා ඔර්ගනික්
        වලට විතරක් පිටු 500 විතර නෝට් එකක් ගොඩගහගන්නවා...පාඩම් කරන්නෙ සර්?????
      </p>
      <br />
      <p>
        මේ තියරි ටික බලලා ඔයාට ප්‍රැක්ටිස් වෙන්න මේ ගේම් එකෙන්ම පුලුවන්. කොලවල
        ලියලා කම්මැලිනම්,එහෙම නැත්තම් බස් එකෙ යන එන මගදි උනත් මේ පරිවර්තනයක්
        දෙකක් කරන් චිල් එකේ යන්න පුලුවන් .. ඒ නිසා මේ වගේ දේවල් වලින් දේවල්
        ගන්න.. ගේම් එකක් උනාට මේක ඉගෙනගන්න දෙයක්.සම්ප්‍රදායික ක්‍රම වෙලම හිරවෙල
        ඉගෙනගත්ත කාලෙ දැන් ඉවරයි..ඇප් එකේ අන්වශ්‍ය කරුනු කිසිවක් නැ ඔක්කොම
        සිලබස් එකට අදාල ඉතාම වැදගත් දේවල්..මෙතනින් පිට දේවල් කිසි දෙයක් විභාගෙට
        අහන්නෙත් නැ..ඇහුවොත් අහන්නෙ මෙ තියරි වලින් හිතන්න පුළුවන් ප්‍රශ්නයක්
        තමයි.
      </p>
      <p>
        එහෙනම් ඉතුරු කොටසින් හම්බවෙමු...විභාගෙ කොහොම හරි ගොඩදාගමූ...ගොඩදාගත්තාම
        උබට නෙවෙයී ඒකෙ සතුට දැනෙන්නෙ උබලටත් වඩා අම්මටයි තාත්තටයී...අත්දැකීමෙන්
        කියන්නෙ ....උබට වඩා සතුටු වෙන්නෙ අම්මයි තාත්තයී..උබ සතුටු වෙනෝනම් සතුටු
        වෙන්නෙ අම්මයි තාත්තයි සතුටු වෙන හැටි දැකලා..ඒකනම් මාරයි මචන් ඒ දේ උබටත්
        පුලුවන් කරලම බලපම් කොහොමද ඒ ෆීලින් එක කියලා.....!
      </p>
      <br />

      <div style={{ textAlign: "center" }}>
        <img src={featureOrganic} alt="Organic" style={{ width: "100%" }} />
      </div>
    </div>
  );
};

export default Theory26;
