import React from "react";
import featureOrganic from "../../feature-organic.jpg"; // Updated import path
import image1 from "./1.png"; // Adjust path as necessary
import image2 from "./2.png"; // Adjust path as necessary
import image3 from "./3.png"; // Adjust path as necessary

const Theory4: React.FC = () => {
  return (
    <div
      style={{
        padding: "20px",
        margin: "20px",
        backgroundColor: "white",
        fontFamily: "Arial, sans-serif",
        lineHeight: 1.6,
        color: "black",
      }}
    >
      <h1
        style={{
          color: "#333",
          textAlign: "center",
          fontSize: "40px",
          fontWeight: "bolder",
        }}
      >
        <b>4. ඇල්කීන දක්වන ප්‍රතික්‍රියා</b>
      </h1>
      <p>
        <br />
      </p>
      <p>
        ඇල්කීන අදුරගන්නෙ කාබන් පරමානු දෙකක් අතර දිවිත්ව බන්දන පවතිනවනම් ඒක බොහො
        විට ඇල්කීනයක් වෙනවා....
      </p>
      <h2>ඇල්කීන සමග පහත ප්‍රතික්‍රියා සිදුවෙ..</h2>
      <p>
        මුලින්ම හොදට බලන්න...ඉට පස්සෙ පහල එම ප්‍රත්ක්‍රියා අපි හිතලා තනියෙන්
        ගන්නෙ කෝමද කියන එක තීනවා..
      </p>
      <br />
      <img
        src={image1}
        alt=""
        style={{ display: "block", margin: "20px auto", maxWidth: "100%" }}
      />
      <img
        src={image2}
        alt=""
        style={{ display: "block", margin: "20px auto", maxWidth: "100%" }}
      />
      <br />
      <h2>හරි. අපි දැන් පලවෙනි ප්‍රතික්‍රියාව බලමු.</h2>
      <p>
        1. CH₃-CH=CH₂ වලට Br₂/CCl₄ දාලා තීන්නේ. මොකක්ද මෙ CCl₄ කියන්නෙ. CCl₄
        කියන්නෙ ප්‍රත්ක්‍රියා මාද්‍ය, එ කියන්නෙ මේක ප්‍රතික්‍රියාවෙ ඵලයට බලපැමක්
        නැ. මේකෙ ප්‍රතික්‍රියා වෙන්නෙ Br₂ . ඇල්කීනයෙ තිබෙන දිවිත්ව බන්දනය අයින්
        වෙලා එ වෙනුවට දෙපැත්තෙ කාබන්ට Br කැලි දෙකක් එකතුවෙනවා.. මේ වගෙ තමයි
        අනිත් ප්‍රතික්‍රියාත්......
      </p>
      <br />
      <p>
        <b>
          2. ඊලග එක HBr දාන එකනෙ. මෙන්න මේක මතක තියාගන්නෙ මෙහෙමයි. ඇල්කීනයෙ
          ද්විත්ව බන්දනය ඉවත් වෙලා HBr වල H එක එකතුවෙන්නෙ H වැඩි පැතතට , Br සෙට්
          වෙන්නෙන් අනිත් පැත්තට. තවදුරතත් පැහැදිලි කලොත් ඇල්කීනයෙ -CH₂=CH₂ කොටස
          බලන්න. මෙකෙ වම් එකෙ H තීන්නෙ දෙකයි. දකුනෙ තුනයි. HBr දැම්මාම H එක
          එන්නෙ දකුනු පැත්තට... දැන් තෙරුනානෙ..!
        </b>
      </p>
      <br />
      <p>
        3. CH₃-CH=CH₂ වලට H₂ /Ni/Pd දානවා. මෙ Ni/Pd කියන්නෙ උත්ප්‍රෙරක. මේව
        දාන්නෙ ප්‍රත්කිරියාව ඉක්මන් කිරිමට පමනි... එතකොට අවසානෙ ඇල්කීනයට
        එකතුවෙන්නෙ ද්විත්ව බන්දනය අයින් වෙලා ඒකෙ දෙපසෙ කාබන්ට H කැලි දෙකක්
        එකතුවෙනවා.
      </p>
      <br />
      <p>
        <b>
          4. ඉලග එකනම් මතක තියාගන්න වෙනවා .ඒකෙත් අර සිස්ටම් එක තීන්නෙ .H වැඩි
          පැතතට H සෙට් වෙලා OH කැල්ල අනිත් එකට සෙට් වෙලා තින්නෙ. මේකනම් මතක
          තියාගන්න ඕන, අපි දාන්නෙ H₂SO₄ උනාට සෙට් වෙන්නෙ H එකකුයි OH එකකුයිනෙ.
        </b>
      </p>
      <p>
        මේක එහෙම වෙන්නෙ කොමද කියලා යාන්ත්‍රන වලදි අන්තිමට කියලා දෙනවා. පරිවර්වතන
        කරද්දි අපිට ඒවා ඕන වෙන්නෙ නැ වගේම යාන්ත්‍රනය කොටසට වඩා පරිවර්තන කොටසට
        වැඩි ලකුනු ප්‍රමානයක් හිමි වෙනවා. අනික යාන්ත්‍රනත් එක්ක මේ ප්‍රත්ක්‍රියා
        කරන්න ගියාම පරිවර්තන කරගන්න හරි අමාරුයි....
        <b>
          මේකත් හරියට පන්ඩිතයට ඒදන්ඩෙ යන්න බැ කියන සීන් එක වගෙ තමා.. ඔක්කොම
          දැනගත්තාම පුලුවන් ඒවත් බැරි වෙනවා... අපි මෙකෙන් ටාගට් කරන්නෙ අඩු
          මෙමරියකින් වැඩි වැඩක් කරන්නෙ කොහොමද කියලා...
        </b>
      </p>
      <p>
        එක නිසා මෙ ප්‍රතික්‍රියාව ටිකක් මතක තියාගන්න වෙනවා. අනිත් තුනනම් දාපු එක
        දැක්ක ගමන් හිතා ගන්න පුලුවන් නේ....
      </p>
      <p className="specialPoints">
        අනික මෙ ප්‍රත්ක්‍රියා හතර ඉතාවැදගත්.. අන්වාර්‍යෙන් පරිවර්තන කැල්ලක මේක
        අහුවෙනවමයි.. ඔයා මේ ටික මතක තියා ගත්තා කියන්නෙ පරිවර්තනේක පොඩි කොටසක්
        පුලුවන් කියන එක......
      </p>
      <br />
      <h2>අමතරව මේකත් දැනගන්න.</h2>
      <br />
      <p>
        CH₃-CH=CH₂ වලට HBr /H₂O₂ එක්ක දැම්මොත් මොකද වෙන්නෙ...කලින් HBr නිකනම්
        දැන්මාම උනෙ H වැඩි පැත්තට H හා අනිත් පැත්තට Br සෙට් උන එකනෙ.. මෙකෙදි
        වෙන්නෙ ඕකෙ අනිත් පැත්ත .ඒ කියන්නෙ H අඩු පැත්තට H එකත් අනිත් පැත්තට Br
        සෙට් වෙන එක...
      </p>
      <img
        src={image3}
        alt=""
        style={{ display: "block", margin: "20px auto", maxWidth: "100%" }}
      />
      <p>මෙ peroxide කියන්නෙ H₂O₂ තමයි...!</p>
      <p>
        ඊලගට අපි ඇල්කයින ගෑන කතා කරමු. එ ටිකත් ඉවර උනාම සමාන්‍ය පරිවර්තන කරන්න
        පුලුවන් වෙනවා... අනිවාරෙන්ම මෙ පිලිවෙලට කරන්න.. බැරි උනොත් පිලිතුරු ආයෙ
        බලන්න.. තියරි ටික මේකෙන් ගොඩදාගත්තට පස්සෙ ඔයාට අපේ ගේම් එකේ ලෙවල්
        ඉස්සරහට කරගෙන යන්න පුළුවන්. මොකද ඒ ලෙවල් තියෙන්නෙ යම්කිසි පිලිවෙලකට.
        ඔයාව බේසික් ලෙවල් එකේ ඉදන්ම practice වෙන්න පුළුවන් විදියට තමයි හදලා
        තියෙන්නෙ.. ඒ නිසා තියරිත් බලලා ගේම් එක play කරන්න. Leaderboard first
        place වෙනුවෙන් try කරන්න!
        <br />
        <b className="highlight">
          ඕනම දේක පටන් ගැන්මයි අමාරු. මුලදි අමතක වෙයි එකපාරට කාටවත් මතක හිටින්නෙ
          නැ. ආයෙ ආයෙ බලන්න.. පරිවර්තන නැවත නැවත ගේම් එකෙන් කරන්න උත්තර හරිද
          බලන්න.. මෙහෙම හෙමීට ගේම ගහගෙන යමු.. උබට ජයෙන් ජය..!
        </b>
      </p>

      <div style={{ textAlign: "center" }}>
        <img src={featureOrganic} alt="Organic" style={{ width: "100%" }} />
      </div>
    </div>
  );
};

export default Theory4;
