import React from "react";
import featureOrganic from "../../feature-organic.jpg"; // Updated import path
import image1 from "./1.png"; // Adjust path as necessary
import image2 from "./2.png"; // Adjust path as necessary
import image3 from "./3.png"; // Adjust path as necessary

const Theory13: React.FC = () => {
  return (
    <div
      style={{
        padding: "20px",
        margin: "20px",
        backgroundColor: "white",
        fontFamily: "Arial, sans-serif",
        lineHeight: 1.6,
        color: "black",
      }}
    >
      <h1
        style={{
          color: "#333",
          textAlign: "center",
          fontSize: "40px",
          fontWeight: "bolder",
        }}
      >
        <b>13. කාබනික සංයොග ඔක්සිහරණය කිරීම.</b>
      </h1>
      <p>
        <br />
      </p>
      <p className="specialPoints">
        මෙහිදි කාබනික සංයෝගයේ ඇති ඔක්සිජන් සම්බන්ධ වූ කාබන්ගේ ඔක්සිකරන අංකය
        අඩුවන අතර අනෙකුත් ස්ථාන වෙනසකට ලක් නොවේ.
      </p>
      <p>
        මෙම ක්‍රියාවලිය සදහා එනම් ඔක්සිහරනය සදහා පහත ඔක්සිහාරකයන් භාවිතා කරයි.
      </p>
      <h2>
        1. LiALH₄ (ලිතියම් ඇලුමිනියම් හයිඩ්‍රයිඩ්) - ප්‍රභල ඔක්සිහාර්‍රකයකි
      </h2>
      <h2>2. NaBH₄ (සෝඩියම් බෝරෝ හයිඩ්‍රයිඩ්) - දුබල ඔක්සිහාරකයකි</h2>

      <br />
      <p className="highlight">ඔක්සිහරනයන්...</p>
      <br />
      <img
        src={image1}
        alt=""
        style={{ display: "block", margin: "20px auto", maxWidth: "100%" }}
      />
      <img
        src={image2}
        alt=""
        style={{ display: "block", margin: "20px auto", maxWidth: "100%" }}
      />
      <br />
      <p>
        <b>
          කාබොක්සලික් අම්ල ඔක්සිහරනයේදී දුබල ඔක්සිහාරක භාවිතා කල නොහැක. එනම් ඒ
          සදහා NaBH₄ භාවිතා කල නොහැක . එනම් ඒ සදහා භාවිත කල හැක්කෙ LiALH₄ ප්‍රභල
          ඔක්සිහාරකය පමනි..
        </b>
      </p>
      <br />
      <img
        src={image3}
        alt=""
        style={{ display: "block", margin: "20px auto", maxWidth: "100%" }}
      />
      <br />
      <p>
        මෙම කොටසෙ ඇති
        <b>
          ඔක්සිහාරක ප්‍රතික්‍රියා තුන හා කලින් ලිපියේ ඔක්සිකරන ප්‍රතික්‍රියා
          හතරනම් මතක තියා ගත යුතුමයි...
        </b>
        ගොඩක් වෙලාවට පේපරෙ නිතරම අහනවා මේ සම්බන්දව... ඔයාට සංයෝගයෙ නමේන් පාඩම්
        කර ගත්තනම් මේක ලේසි වෙයි කියලා හිතනවා.. හැබැයි ඊට වඩා ලෙසියි ඔයා මේ
        ඔක්සිහරන ඔක්සිකරන ටික
        <b>
          ආයෙ කොලේක නැවත නැවතත් ලියලා ප්‍රැක්ටිස් කරන එක.. ඒක තමයි හොදම ක්‍රමය
          විදියට මම දකින්නෙ....
        </b>
        වැඩිය නැනෙ වර්ග හතක් වගේ තීන්නෙ ඔක්සිකරන 4 ඔක්සිහරන 3.... අනිවා මතක
        තියාගත යුතුම කරුනු ටිකක්..
      </p>
      <p>
        <b>
          ඒ වගේම මේ දේවල් ප්‍රැක්ටිස් වෙන්න ගේම් එකේ සෑහෙන්න ප්‍රශ්න දාලා
          තියෙනවා.. මේ දැන් උගන්වපු සෙට් එක අනිවාර්‍යෙන් පරිවර්තන ප්‍රශ්නයක
          අඩංගු වෙන්න තියෙන සම්භාවිතාව 90% විතර. ඒ නිසා මේ ටික හොදට මතකතියාගන්න.
          පුලුවන් තරම් ප්‍රශ්න කරලා ප්‍රැක්ටිස් වෙන්න. අපි ගේම් එකෙත් මේ දේවල්
          නිතරම වගේ ප්‍රශ්නවල හම්බ වේවී. මොකද මේ ටික අනිවාර්‍යෙන් මතක තියාගන්නම
          ඕන ප්‍රශ්න ටිකක්
        </b>
      </p>

      <br />
      <p className="specialPoints">
        වැදගත් - මේ ලෙවල් එක වෙද්දි ඔයාට ඔර්ගනික් ගැන යම් මට්ටමක දැනුමක් තියෙන්න
        ඕන සහ ගොඩක් පාස්ට් පේපර්ස් ප්‍ර්ශ්න උනත් කරන්න පුලුවන් වෙනවා.. හැබැයි මේ
        තියරි බලපු ගමන් බෑ ප්‍රැක්ටිස් එක තියෙන්න ඕන ඉතින්. අපේ මේ දැනට දීපු
        තියරි ටික හොදට බැලුවනම් වැල් වටාරම් නැතුව මේ දේවල් ගොඩදාගන්න පුලුවන්.
        විභාගෙදි අහන්නෙ නෑ ඔයාලගෙන් කව්ද මේ මේ සංයෝග හොයාගත්තෙ ඒවා මේවා.. ඒ නිසා
        අනවශය දේවල් අයින් කරලා අවශ්‍යම ටිකෙන් ගේම ගහන්න තමයි අපි මේ තියරි ටික
        හදලා තියෙන්නෙ..
      </p>
      <br />
      <div style={{ textAlign: "center" }}>
        <img src={featureOrganic} alt="Organic" style={{ width: "100%" }} />
      </div>
    </div>
  );
};

export default Theory13;
